#pragma once
//-----------------------------------------------------------------------------
//! @file	DataBuffer.h
//! @brief	データのバッファクラス、複数のファイルでデータを使用したいので、staticクラスにします。
//! @author	山﨑愛
//-----------------------------------------------------------------------------
#include <vector>
#include <unordered_map>
#include "Types.h"
//-----------------------------------------------------------------------------
//	データのバッファクラス
//-----------------------------------------------------------------------------
class DataBuffer {
public:
	static void Init();//初期化関数
	//-----------------------------------------------------------------------------
	//!	@brief	レストランデータを取得する関数
	//! @return	restaurantのデータを格納したバッファ
	//-----------------------------------------------------------------------------
	static const domain::RestaurantData& GetRestaurantData() { return restaurant_data_; };
	//-----------------------------------------------------------------------------
	//!	@brief	データのキー一覧を取得する関数
	//! @return	データのキーを格納したバッファ
	//-----------------------------------------------------------------------------
	static const std::vector<std::string>& GetDataKeys() { return data_keys_; };

private:
	static domain::RestaurantData restaurant_data_;//restaurantのデータを格納したバッファ
	static std::vector<std::string> data_keys_;//データのキー一覧
};