#pragma once
//----------------------------------------------------------------------------------------
//!	@file	FilteredSearch.h
//! @brief	絞り込み検索を行う一連の処理
//! @author 山﨑愛
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//	絞り込み検索を行う一連の処理
//----------------------------------------------------------------------------------------
void processFilteredSearch();
//----------------------------------------------------------------------------------------
//  データを絞り込む関数
//! @param data [in] 絞り込み対象のデータ
//! @param key [in] 絞り込みに使用するデータのキー
//! @param term [in] 絞り込みに使用する検索文字列
//! @return 絞り込まれたデータ
//----------------------------------------------------------------------------------------
domain::RestaurantData FilterData(const domain::RestaurantData& data, const std::string& key, const std::u8string& term);