//----------------------------------------------------------------------------------------
//!	@file	information.cpp
//! @brief	案内関数群
//! @author 山﨑愛
//----------------------------------------------------------------------------------------
#include <iostream>
#include "System.h"
#include "information.h"
//----------------------------------------------------------------------------------------
//! @brief	検索の案内を表示する関数
//----------------------------------------------------------------------------------------
void ShowSearchInformation() {
	std::u8string infomation = u8"検索オプションを選択してください\n1:都道府県\n2:地域\n3:ジャンル\n4:駅\n";//案内メッセージ(仮)
	printUtf8(infomation);
}