//-----------------------------------------------------------------------------
//! @file	System.cpp
//! @brief	システム関係の関数などをまとめたファイル
//! @author	山﨑愛
//-----------------------------------------------------------------------------
#include <iostream>
#include <string>
#include "System.h"
//-----------------------------------------------------------------------------
//! @brief	UTF-8で文字列を表示する関数
//-----------------------------------------------------------------------------
void printUtf8(const std::u8string& str) {
	std::cout << ToString(str) << std::endl;
}
//-----------------------------------------------------------------------------
//! @brief	stringをu8stringに変換する関数
//-----------------------------------------------------------------------------
std::u8string ToU8String(const std::string& str) {
	return std::u8string(str.begin(), str.end());
}
//-----------------------------------------------------------------------------
//! @brief	u8stringをstringに変換する関数
//-----------------------------------------------------------------------------
std::string ToString(const std::u8string& u8str) {
	return std::string(u8str.begin(), u8str.end());
}
//-----------------------------------------------------------------------------
//! @brief	UTF-8で文字列を表示する関数（改行なし）
//-----------------------------------------------------------------------------
void printUtf8NoNewline(const std::u8string& str) {
	std::cout << ToString(str);  // endlを付けない
}