#pragma once
//-----------------------------------------------------------------------------
//! @file	System.h
//! @brief	システム関係の関数などをまとめたファイル
//! @author	山﨑愛
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
//	UTF-8で文字列を表示する関数
//! @param	u8string [in] 表示させたい文字列
//! @note	システム周りの関数なので、キャメルケースにしておきます。
//-----------------------------------------------------------------------------
void printUtf8(const std::u8string& str);
//-----------------------------------------------------------------------------
//	stringをu8stringに変換する関数
//! @param	str [in] 変換したい文字列
//! @return	変換後の文字列
//-----------------------------------------------------------------------------
std::u8string ToU8String(const std::string& str);
//-----------------------------------------------------------------------------
//	u8stringをstringに変換する関数
//! @param	u8str [in] 変換したい文字列
//! @return	変換後の文字列
//-----------------------------------------------------------------------------
std::string ToString(const std::u8string& u8str);
//-----------------------------------------------------------------------------
//	改行なしでUTF-8で文字列を表示する関数
//! @param	u8string [in] 表示させたい文字列
//! @note	システム周りの関数なので、キャメルケースにしておきます。
//-----------------------------------------------------------------------------
void printUtf8NoNewline(const std::u8string& str);