#pragma once
//-----------------------------------------------------------------------------
//! @file	System.h
//! @brief	システム関係の関数などをまとめたファイル
//! @author	山﨑愛
//-----------------------------------------------------------------------------
#include <functional>
//-----------------------------------------------------------------------------
//	UTF-8で文字列を表示する関数
//! @param	u8string [in] 表示させたい文字列
//! @note	システム周りの関数なので、キャメルケースにしておきます。
//-----------------------------------------------------------------------------
void printUtf8(const std::u8string& str);
//-----------------------------------------------------------------------------
//	stringをu8stringに変換する関数
//! @param	str [in] 変換したい文字列
//! @return	変換後の文字列
//-----------------------------------------------------------------------------
std::u8string ToU8String(const std::string& str);
//-----------------------------------------------------------------------------
//	u8stringをstringに変換する関数
//! @param	u8str [in] 変換したい文字列
//! @return	変換後の文字列
//-----------------------------------------------------------------------------
std::string ToString(const std::u8string& u8str);
//-----------------------------------------------------------------------------
// 数値入力を安全に取得する関数
//! @param min [in] 読み取る数値の最小値
//! @param max [in] 読み取る数値の最大値
//! @param prompt_message [in] エラー時にユーザーに表示するメッセージ （省略可能）
//! @param on_invalid [in] 無効な入力があった場合に呼び出されるコールバック関数（省略可能）
//-----------------------------------------------------------------------------
int GetValidNum(int min, int max, const std::u8string& error_message = u8"無効な入力です。もう一度入力してください。\n", const std::function<void()>& on_invalid = nullptr);
//-----------------------------------------------------------------------------
// ユーザーから1行のUTF-8文字列入力を取得する関数
//! @param	prompt [in] ユーザーに表示するプロンプトメッセージ
//! @return	取得したUTF-8文字列
//-----------------------------------------------------------------------------
std::u8string ReadLineUtf8(const std::u8string& prompt = u8" ");