//-----------------------------------------------------------------------------
//! @file	System.cpp
//! @brief	システム関係の関数などをまとめたファイル
//! @author	山﨑愛
//-----------------------------------------------------------------------------
#include <iostream>
#include <string>
#include "System.h"
//-----------------------------------------------------------------------------
//! @brief	UTF-8で文字列を表示する関数
//-----------------------------------------------------------------------------
void printUtf8(const std::u8string& str) {
	std::cout << reinterpret_cast<const char*>(str.c_str()) << std::endl;
}